## Plan Result (stg_apim - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.api-mgmt.azurerm_api_management_api_policy.apim
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.azurerm_api_management_api_policy.apim will be created
  + resource "azurerm_api_management_api_policy" "apim" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "health"
      + id                  = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <mock-response status-code="200" content-type="application/json" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain will be created
  + resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      + api_management_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg"
      + id                = (known after apply)

      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt.aat.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappsstg.vault.azure.net/secrets/wildcard-aat-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt-appgw.aat.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappsstg.vault.azure.net/secrets/wildcard-aat-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-mtls-api-mgmt-appgw.aat.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappsstg.vault.azure.net/secrets/wildcard-aat-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2292,"Program":"tfcmt","SHA1":"","Target":"stg_apim - TerraformPlanApply","Vars":{}} -->